app/views/post/_header.html.slim

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 2]]
---
      p.profile-thumb-line
        =current_user.posts.length