app/controllers/post_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
  def new
    @posts  = Post.order('created_at DESC').paginate(page: params[:page])

INSERT INTO "posts" ("message", "user_id", "created_at", "updated_at", "tag", "picture") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["message", "gateau !"], ["user_id", 2], ["created_at", 2016-08-26 20:01:43 UTC], ["updated_at", 2016-08-26 20:01:43 UTC], ["tag", "cake"], ["picture", "gateau-coeur-saint-valentin.jpg"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if !@post.save

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 63]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
---
  def delete
    Post.find(params[:post]).delete